Repository: RVApeldoorn/MeasureApp
Catalog: lib/l10n/app_*.arb
Languages: ar, it, nl, tr, zh

# app_title
source: Measurement
ar: القياس
it: Misurazione
nl: Metingen
tr: Ölçüm
zh: 测量

source: Connect
ar: اتصل
it: Connetti
nl: Verbinding maken
tr: Bağlan
zh: 连接

source: Connecting...
ar: جاري الاتصال...
it: Connessione in corso...
nl: Verbinding maken...
tr: Bağlanıyor...
zh: 连接中...

# pin_set
source: Set your pincode
ar: حدد الكود ديالك
it: Imposta il tuo codice PIN
nl: Stel je pincode in
tr: PIN kodunuzu ayarlayın
zh: 设置您的密码

# pin_enter
source: Enter your pincode
ar: دخل الكود ديالك
it: Inserisci il tuo codice PIN
nl: Voer je pincode in
tr: PIN kodunuzu girin
zh: 输入您的密码

# pin_confirm
source: Confirm your pincode
ar: عاود دخل الكود باش تأكد
it: Conferma il tuo codice PIN
nl: Bevestig je pincode
tr: PIN kodunuzu onaylayın
zh: 确认您的密码

# pin_error
source: PIN codes do not match
ar: الكودات ماشي بحال بحال
it: I codici PIN non corrispondono
nl: De pincodes komen niet overeen
tr: PIN kodları eşleşmiyor
zh: 密码不匹配

# pin_reset_confirm_title
source: Confirmation
ar: تأكيد
it: Conferma
nl: Bevestiging
tr: Onay
zh: 确认

# pin_reset_confirm_content
source: Are you sure you want to reset your PIN? The app will be reset.
ar: واخا باغي تبدل الكود؟ راه التطبيق غادي يرجع من الأول.
it: Sei sicuro di voler resettare il tuo PIN? L'app verrà resettata.
nl: Weet je zeker dat je je pincode wilt resetten? De app wordt gereset.
tr: PIN'inizi sıfırlamak istediğinizden emin misiniz? Uygulama sıfırlanacaktır.
zh: 您确定要重置您的密码吗？应用程序将被重置。

source: Cancel
ar: إلغاء
it: Annulla
nl: Annuleren
tr: İptal
zh: 取消

source: Confirm
ar: تأكيد
it: Conferma
nl: Bevestigen
tr: Onayla
zh: 确认

# pin_forgot
source: Forgot PIN
ar: نسيت الكود؟
it: PIN dimenticato
nl: Pincode vergeten
tr: PIN'i unuttum
zh: 忘记密码

# enter_setup_code
source: Enter your setup code
ar: دخل الكود ديال التفعيل
it: Inserisci il tuo codice di configurazione
nl: Voer je setup-code in
tr: Kurulum kodunuzu girin
zh: 输入您的设置代码

source: Setup Code
ar: كود التفعيل
it: Codice di configurazione
tr: Kurulum Kodu
zh: 设置代码

# setup_code_instructions
source: Your setup code is available from your healthcare provider. Contact test@test.com for assistance.
ar: كود التفعيل متاح عند مزود الرعاية الصحية ديالك. اتصل بـ test@test.com للمساعدة.
it: Il tuo codice di configurazione è disponibile presso il tuo operatore sanitario. Contatta test@test.com per assistenza.
nl: Jouw setup-code is beschikbaar via je zorgverlener. Neem contact op met test@test.com voor hulp.
tr: Kurulum kodunuz sağlık hizmeti sağlayıcınızdan temin edilebilir. Yardım için test@test.com ile iletişime geçin.
zh: 您的设置代码由您的医疗服务提供者提供。 请联系 test@test.com 寻求帮助。

source: Verify
ar: تأكد
it: Verifica
nl: VerifiÃ«ren
tr: Doğrula
zh: 验证

source: Invalid setup code!
ar: الكود غير صالح!
it: Codice di configurazione non valido!
nl: Ongeldige setup-code!
tr: Geçersiz kurulum kodu!
zh: 无效的设置代码！

source: Growth Safari
ar: رحلة النمو
it: Safari della crescita
nl: Groei Safari
tr: Büyüme Safari
zh: 成长探险

source: Growth Curve
ar: منحنى النمو
it: Curva di crescita
nl: Groeicurve
tr: Büyüme Eğrisi
zh: 成长曲线

# growth_curve_description
source: This is an overview of your past height measurements.
ar: هذا نظرة عامة على قياسات الطول السابقة ديالك.
it: Questa è una panoramica delle tue misurazioni passate dell'altezza.
nl: Dit is een overzicht van je eerdere lengtemetingen.
tr: Bu, geçmiş boy ölçümlerinize genel bir bakıştır.
zh: 这是您过去身高测量的概览。

# no_sessions_message
source: No outstanding tasks ðŸŽ‰
ar: ما كاينين حتى مهام 🎉
it: Nessun compito in sospeso 🎉
nl: Geen openstaande taken ðŸŽ‰
tr: Bekleyen görev yok 🎉
zh: 没有未完成的任务 🎉

# session_title
source: Request {month}
ar: طلب شهر {month}
it: Richiesta {month}
nl: Verzoek {month}
tr: Talep {month}
zh: 请求 {month}

# session_fulfilled
source: {filledCount}/{totalCount} fulfilled
ar: {filledCount}/{totalCount} واجدة
it: {filledCount}/{totalCount} completati
nl: {filledCount}/{totalCount} voltooid
tr: {filledCount}/{totalCount} tamamlandı
zh: {filledCount}/{totalCount} 已完成

# session_deadline_label
source: Deadline:
ar: آخر أجل:
it: Scadenza:
tr: Son tarih:
zh: 截止日期：

# session_unimplemented_type
source: Measurement type not implemented
ar: نوع القياس ما موجدش
it: Tipo di misurazione non implementato
nl: Meettype niet geÃ¯mplementeerd
tr: Ölçüm türü uygulanmamış
zh: 未实现的测量类型

source: Height
ar: الطول
it: Altezza
nl: Lengte
tr: Boy
zh: 身高

source: Weight
ar: الوزن
it: Peso
nl: Gewicht
tr: Kilo
zh: 体重

source: Temperature
ar: الحرارة
it: Temperatura
nl: Temperatuur
tr: Ateş
zh: 体温

source: Good morning
ar: صباح الخير
it: Buongiorno
nl: Goedemorgen
tr: Günaydın
zh: 早上好

source: Good afternoon
ar: مساء الخير
it: Buon pomeriggio
nl: Goedemiddag
tr: İyi günler
zh: 下午好

source: Good evening
ar: ليلة سعيدة
it: Buonasera
nl: Goedenavond
tr: İyi akşamlar
zh: 晚上好

# month1
source: January
ar: يناير
it: Gennaio
nl: januari
tr: Ocak
zh: 一月

# month2
source: February
ar: فبراير
it: Febbraio
nl: februari
tr: Şubat
zh: 二月

# month3
source: March
ar: مارس
it: Marzo
nl: maart
tr: Mart
zh: 三月

# month4
source: April
ar: أبريل
it: Aprile
tr: Nisan
zh: 四月

# month5
source: May
ar: ماي
it: Maggio
nl: mei
tr: Mayıs
zh: 五月

# month6
source: June
ar: يونيو
it: Giugno
nl: juni
tr: Haziran
zh: 六月

# month7
source: July
ar: يوليوز
it: Luglio
nl: juli
tr: Temmuz
zh: 七月

# month8
source: August
ar: غشت
it: Agosto
nl: augustus
tr: Ağustos
zh: 八月

# month9
source: September
ar: شتنبر
it: Settembre
tr: Eylül
zh: 九月

# month10
source: October
ar: أكتوبر
it: Ottobre
nl: oktober
tr: Ekim
zh: 十月

# month11
source: November
ar: نونبر
it: Novembre
tr: Kasım
zh: 十一月

# month12
source: December
ar: دجنبر
it: Dicembre
tr: Aralık
zh: 十二月

source: Measurement
ar: القياس
it: Misurazione
nl: Meting
tr: Ölçüm
zh: 测量

source: Measurement complete
ar: القياس اكتمل
it: Misurazione completata
nl: Meting voltooid
tr: Ölçüm tamamlandı
zh: 测量完成

source: Height measurement
ar: قياس الطول
it: Misurazione altezza
nl: Lengtemeting
tr: Boy ölçümü
zh: 身高测量

# hangLaser
source: Hang the laser on an empty wall and press next for reference.
ar: علق الجهاز على حيط فاضي واضغط التالي لبدء قياس الإشارة.
it: Appendi il dispositivo a una parete vuota e premi Avanti per la misurazione di riferimento.
nl: Bevestig het apparaat aan een vrije muur en druk op Volgende voor een referentie-meting.
tr: Cihazı boş bir duvara yerleştirin ve referans ölçümü için İleri'ye basın.
zh: 将设备挂在空墙上，然后点击“下一步”进行参考测量。

# resultReference
source: The reference measurement is
ar: قياس الإشارة هو
it: La misurazione di riferimento è
nl: De referentiemeting is
tr: Referans ölçümü
zh: 参考测量为

source: Save reference
ar: سجل الإشارة
it: Salva riferimento
nl: Sla referentie op
tr: Referansı kaydet
zh: 保存参考值

# successReference
source: Reference measurement successful
ar: قياس الإشارة ناجح
it: Misurazione di riferimento riuscita
nl: Referentiemeting succesvol
tr: Referans ölçümü başarılı
zh: 参考测量成功

# warningReference
source: Please perform a measurement first
ar: قيس الأول باش تبدا
it: Esegui prima una misurazione
nl: Voer eerst een meting uit
tr: Önce bir ölçüm yapın
zh: 请先进行一次测量

# referenceTitle
source: Reference Measurement
ar: قياس الإشارة
it: Misurazione di riferimento
nl: Referentiemeting
tr: Referans Ölçümü
zh: 参考测量

# referenceStep
source: Step 1: Reference
ar: خطوة 1: الإشارة
it: Fase 1: Riferimento
nl: Stap 1: Referentie
tr: Adım 1: Referans
zh: 步骤 1：参考

# nextStep
source: Go to next step
ar: دوز للخطوة الجاية
it: Vai al passo successivo
nl: Ga naar volgende stap
tr: Sonraki adıma geç
zh: 进入下一步

# measureDescription
source: The measurement is now being taken. Click Measure distance to complete the measurement.
ar: ضع الطفل فالموضع الصحيح واضغط التالي باش تقيس.
it: Posiziona il bambino correttamente e premi Avanti per misurare.
nl: Positioneer uw kind correct en druk op Volgende om te meten.
tr: Çocuğu doğru şekilde konumlandırın ve ölçüm yapmak için İleri'ye basın.
zh: 将孩子正确放置，然后点击“下一步”进行测量。

# titleLength
source: Length Measurement
ar: قياس الطول
it: Misurazione della lunghezza
nl: Lengtemeting
tr: Uzunluk Ölçümü
zh: 长度测量

# lengthStep
source: Step 7
ar: خطوة 7
it: Fase 7
nl: Stap 7
tr: Adım 7
zh: 步骤 7

source: Measure distance
ar: قيس المسافة
it: Misura distanza
nl: Meetafstand
tr: Mesafeyi ölç
zh: 测量距离

# relaxChild
source: Let the child breathe relaxed.
ar: خلي الطفل يتنفس براحة.
it: Fai respirare il bambino in modo rilassato.
nl: Laat het kind rustig ademhalen.
tr: Çocuğun rahat nefes almasını sağlayın.
zh: 让孩子放松呼吸。

# step2Elephant
source: Blow as hard as an Elephant!
ar: نفخ بحال الفيل!
it: Soffia forte come un elefante!
nl: Blaas zo hard als een olifant!
tr: Bir fil gibi güçlü üfle!
zh: 像大象一样用力吹气！

source: Bla bla bla
ar: بلا بلا بلا
tr: Laf laf laf
zh: 嗒嗒嗒

source: Settings
ar: الإعدادات
it: Impostazioni
nl: Instellingen
tr: Ayarlar
zh: 设置

source: Preferences
ar: التفضيلات
it: Preferenze
nl: Voorkeuren
tr: Tercihler
zh: 偏好

source: Child mode
ar: وضع الأطفال
it: Modalità bambino
nl: Kindermodus
tr: Çocuk modu
zh: 儿童模式

# child_mode_helpertext
source: Enable child-friendly exercises during measurement
ar: فعل التمارين لي تلائم الأطفال أثناء القياس
it: Abilita esercizi adatti ai bambini durante la misurazione
nl: Schakel kindvriendelijke oefeningen in tijdens de meting
tr: Ölçüm sırasında çocuk dostu egzersizleri etkinleştir
zh: 在测量期间启用适合儿童的练习

source: Exercises
ar: تمارين
it: Esercizi
nl: Oefeningen
tr: Egzersizler
zh: 练习

source: Insight
ar: نظرة عامة
it: Intuizione
nl: Inzicht
tr: İçgörü
zh: 洞察

source: Relaxing exercises
ar: تمارين مريحة
it: Esercizi rilassanti
nl: Ontspanningsoefeningen
tr: Rahatlatıcı egzersizler
zh: 放松练习

# relaxing_exercise
source: Relaxed exercise
ar: تمرين مريح
it: Esercizio rilassante
nl: Rustige oefening
tr: Rahatlatıcı egzersiz
zh: 放松练习

# exerciseFollow
source: Repeat the exercise
ar: عاود التمرين
it: Ripeti l'esercizio
nl: Herhaal de oefening
tr: Egzersizi tekrar et
zh: 重复练习

source: Step
ar: خطوة
it: Fase
nl: Stap
tr: Adım
zh: 步骤

source: Next
ar: التالي
it: Avanti
nl: Volgende
tr: İleri
zh: 下一步

# growth
source: Your growth
ar: نموك
it: La tua crescita
nl: Jouw groei
tr: Büyümeniz
zh: 您的成长

source: Home
ar: الرئيسية
nl: Start
tr: Ana Sayfa
zh: 首页

source: Language
ar: اللغة
it: Lingua
nl: Taal
tr: Dil
zh: 语言

# noMeasurement
source: No measurement available
ar: ما كاينش قياس متاح
it: Nessuna misurazione disponibile
nl: Geen meting beschikbaar
tr: Ölçüm mevcut değil
zh: 无测量数据

source: Skip
ar: تخطى
it: Salta
nl: Overslaan
tr: Atla
zh: 跳过

# successful
source: The measurement is successful. See your results here
ar: القياس ناجح. شوف النتائج هنا.
it: La misurazione è riuscita. Vedi i tuoi risultati qui sotto.
nl: De meting is succesvol. Bekijk je resultaten hieronder.
tr: Ölçüm başarılı. Sonuçlarınızı burada görün.
zh: 测量成功。 在此查看您的结果。

# view
source: Submit and view
ar: سجل وشوف
it: Invia e visualizza
nl: Indienen en bekijken
tr: Gönder ve görüntüle
zh: 提交并查看

source: Questions
ar: أسئلة
it: Domande
nl: Vragen
tr: Sorular
zh: 问题

# submit
source: Submit measurement
ar: سجل القياس
it: Invia misurazione
nl: Meting indienen
tr: Ölçümü gönder
zh: 提交测量

source: Posture instructions
ar: تعليمات الوضعية
it: Istruzioni sulla postura
nl: Houdingsinstructies
tr: Duruş talimatları
zh: 姿势指导

# review_and_submit
source: Review and submit results
ar: راجع وسجل النتائج
it: Rivedi e invia i risultati
nl: Controleer en verzend resultaten
tr: Sonuçları gözden geçir ve gönder
zh: 审阅并提交结果

# relaxationExercise
source: Guide your child through a brief relaxation exercise to ensure a calm state before measuring.
ar: وجّه طفلك باش يعمل تمرين مريح بسيط باش يكون هادئ قبل القياس.
it: Guida il tuo bambino in un breve esercizio di rilassamento per assicurarti che sia calmo prima della misurazione.
nl: Begeleid uw kind bij een korte ontspanningsoefening om kalm te zijn voor de meting.
tr: Çocuğunuzu ölçüm öncesi sakinleştirmek için kısa bir rahatlama egzersizi yaptırın.
zh: 指导您的孩子进行短暂的放松练习，以确保测量前保持平静。

# postureStep1
source: Have your child stand against a flat, clear wall with no obstructions.
ar: خلي طفلك يوقف حدا حيط مسطح وفارغ بلا عياق.
it: Fai stare il tuo bambino contro una parete piatta e sgombra senza ostacoli.
nl: Laat uw kind tegen een vlakke, vrije muur staan zonder obstakels.
tr: Çocuğunuzun engelsiz, düz bir duvara karşı durmasını sağlayın.
zh: 让您的孩子站在平整、没有障碍的墙边。

# postureStep2
source: Ensure your child's feet, back, and head are flat against the wall.
ar: تأكد بلي رجلين، ظهر و راس الطفل ملتصقين بالحيط.
it: Assicurati che i piedi, la schiena e la testa del tuo bambino siano piatti contro la parete.
nl: Zorg dat de voeten, rug en het hoofd van uw kind plat tegen de muur staan.
tr: Çocuğunuzun ayaklarının, sırtının ve başının duvara tam temas ettiğinden emin olun.
zh: 确保孩子的脚、背和头平贴在墙上。

# postureStep3
source: Check that your child's shoulders are level and eyes are facing forward.
ar: شوف واش كتاف الطفل مستويين و عينيه كيشوفو لقدام.
it: Controlla che le spalle del tuo bambino siano livellate e gli occhi guardino avanti.
nl: Controleer of de schouders van uw kind recht zijn en de ogen naar voren kijken.
tr: Çocuğunuzun omuzlarının düz ve gözlerinin öne baktığından emin olun.
zh: 检查孩子的肩膀是否水平，眼睛是否朝向前方。

# deviceSetup
source: To connect the device, ensure it is powered on and within close range.
ar: باش تتصل بالجهاز، تأكد بلي مشتغل و قريب.
it: Per connettere il dispositivo, assicurati che sia acceso e a portata ravvicinata.
nl: Zet het meetapparaat aan en houdt het in de buurt om verbinding te maken.
tr: Cihazı bağlamak için açık olduğundan ve yakın mesafede bulunduğundan emin olun.
zh: 要连接设备，请确保其已开启并在附近。

# referenceMeasurement
source: Mount the device on a clear wall and press Next to take a reference measurement.
ar: علق الجهاز على حيط فارغ واضغط التالي لبدء قياس الإشارة.
it: Appendi il dispositivo a una parete sgombra e premi Avanti per effettuare una misurazione di riferimento.
nl: Bevestig het apparaat aan een vrije muur en druk op Volgende voor een referentie-meting.
tr: Cihazı boş bir duvara yerleştirin ve referans ölçümü için İleri'ye basın.
zh: 将设备挂在空墙上，然后点击“下一步”进行参考测量。

# measurementInstruction
source: Position your child correctly and press Next to measure.
ar: ضع الطفل فالموضع الصحيح واضغط التالي باش تقيس.
it: Posiziona il bambino correttamente e premi Avanti per misurare.
nl: Positioneer uw kind correct en druk op Volgende om te meten.
tr: Çocuğu doğru şekilde konumlandırın ve ölçüm yapmak için İleri'ye basın.
zh: 将孩子正确放置，然后点击“下一步”进行测量。

# measurementSuccess
source: Measurement completed successfully. View your results below.
ar: القياس ناجح. شوف النتائج لتحت.
it: Misurazione completata con successo. Vedi i tuoi risultati qui sotto.
nl: Meting succesvol afgerond. Bekijk uw resultaten hieronder.
tr: Ölçüm başarıyla tamamlandı. Sonuçlarınızı aşağıda görün.
zh: 测量成功完成。在此查看您的结果。

# questionExpand
source: Do you have any questions about your results? A doctor will respond promptly via the app.
ar: عندك شي سؤال على النتائج؟ طبيب غادي يجاوبك بسرعة عبر التطبيق.
it: Hai domande sui tuoi risultati? Un medico risponderà rapidamente tramite l'app.
nl: Heeft u vragen over uw resultaten? Een arts zal snel reageren via de app.
tr: Sonuçlarınızla ilgili sorularınız mı var? Bir doktor uygulama üzerinden hızla yanıt verecektir.
zh: 对您的结果有任何疑问吗？医生将通过应用程序迅速回复。

# referenceResult
source: The device measured a distance of {measurementValue} cm to the floor.
ar: الجهاز قاس مسافة {measurementValue} سم للأرض.
it: Il dispositivo ha misurato una distanza di {measurementValue} cm dal pavimento.
nl: Het apparaat heeft een afstand van {measurementValue} cm tot de vloer gemeten.
tr: Cihaz, yere {measurementValue} cm mesafe ölçtü.
zh: 设备测量到与地板的距离为 {measurementValue} 厘米。

# heightResult
source: Height: {height} cm Reference: {reference} cm Distance: {distance} cm
ar: الطول: {height} سم الإشارة: {reference} سم المسافة: {distance} سم
it: Altezza: {height} cm Riferimento: {reference} cm Distanza: {distance} cm
nl: Lengte: {height} cm Referentie: {reference} cm Afstand: {distance} cm
tr: Boy: {height} cm Referans: {reference} cm Mesafe: {distance} cm
zh: 身高：{height} 厘米 参考：{reference} 厘米 距离：{distance} 厘米

# retry
source: Try Again
ar: عاود حاول
it: Riprova
nl: Opnieuw proberen
tr: Tekrar dene
zh: 重试
